АгрегаторМаркетплейсов/src/Documents/ОтчетОПродажахМаркетплейса/ОтчетОПродажахМаркетплейса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОПродажахМаркетплейса</name>
  <registerRecords>AccumulationRegister.ПродажиМаркетплейсов</registerRecords>
  <attributes>
    <name>Маркетплейс</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧистаяПрибыль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АгрегаторМаркетплейсов/src/Documents/ОтчетОПродажахМаркетплейса/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура РассчитатьСтрокуТоваров(СтрокаТовары)

    Если СтрокаТовары = Неопределено Тогда
        Возврат;
    КонецЕсли;

    СтрокаТовары.СуммаПродажи = СтрокаТовары.Количество * СтрокаТовары.ЦенаПродажи;

    СебестоимостьЕдиницы = 0;

    Если ЗначениеЗаполнено(СтрокаТовары.Товар) Тогда
        СебестоимостьЕдиницы = ПолучитьСебестоимостьТовара(СтрокаТовары.Товар);
    КонецЕсли;

    СтрокаТовары.Себестоимость = СтрокаТовары.Количество * СебестоимостьЕдиницы;

    КомиссияПроцент = 0;

    Если ЗначениеЗаполнено(Объект.Маркетплейс) Тогда
        КомиссияПроцент = ПолучитьКомиссиюМаркетплейса(Объект.Маркетплейс);
    КонецЕсли;

    СтрокаТовары.Комиссия = Окр(СтрокаТовары.СуммаПродажи * КомиссияПроцент / 100, 2);

    СтрокаТовары.ЧистаяПрибыль = СтрокаТовары.СуммаПродажи
        - СтрокаТовары.Комиссия
        - СтрокаТовары.Себестоимость;

КонецПроцедуры

&НаКлиенте
Процедура МаркетплейсПриИзменении(Элемент)

    Для Каждого СтрокаТовары Из Объект.Товары Цикл
        РассчитатьСтрокуТоваров(СтрокаТовары);
    КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКомиссиюМаркетплейса(МаркетплейсСсылка)

    Если Не ЗначениеЗаполнено(МаркетплейсСсылка) Тогда
        Возврат 0;
    КонецЕсли;

    Возврат МаркетплейсСсылка.Комиссия;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСебестоимостьТовара(ТоварСсылка)

    Если Не ЗначениеЗаполнено(ТоварСсылка) Тогда
        Возврат 0;
    КонецЕсли;

    Возврат ТоварСсылка.Себестоимость;

КонецФункции


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
    РассчитатьСтрокуТоваров(ТекущаяСтрока);

КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПродажиПриИзменении(Элемент)

    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
    РассчитатьСтрокуТоваров(ТекущаяСтрока);

КонецПроцедуры


&НаКлиенте
Процедура ТоварыКомиссияПриИзменении(Элемент)

    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
    РассчитатьСтрокуТоваров(ТекущаяСтрока);

КонецПроцедуры
